const handler = async (m, { conn }) => {
  let menu = `🌌 𝖧𝗈𝗅𝖺! 𝖻𝗂𝖾𝗇𝗏𝖾𝗇𝗂𝖽𝗈 𝖺𝗅 𝗆𝖾𝗇𝗎𝗀𝗋𝗎𝗉𝗈 𝖽𝖾 *𝐑𝐉 𝐁𝐎𝐓 𝐈𝐀* 𝖺𝗾𝗎𝗂́ 𝖾𝗇𝖼𝗈𝗇𝗍𝗋𝖺𝗋𝖺́𝗌 𝗅𝗈𝗌 𝖼𝗈𝗆𝖺𝗇𝖽𝗈𝗌 𝗉𝖺𝗋𝖺 𝗆𝖺𝗇𝗍𝖾𝗇𝖾𝗋 𝗎𝗇 𝗍𝗈𝗍𝖺𝗅 𝗈𝗋𝖽𝖾𝗇 𝖽𝖾 𝗍𝗎́ 𝗀𝗋𝗎𝗉𝗈!

✮,— 𝐈𝐍𝐅𝐎𝐑𝐌𝐀𝐂𝐈𝐎𝐍 .ᐟᨮׁׅ֮.ᐟ
⭒ ִֶָ७☁️˙⋆｡ -𝗅𝗂𝖽
⭒ ִֶָ७☁️˙⋆｡ -𝗈𝗐𝗇𝖾𝗋
⭒ ִֶָ७☁️˙⋆｡ -𝗋𝖾𝗉𝗈𝗋𝗍𝖾
⭒ ִֶָ७☁️˙⋆｡ -𝗉𝗂𝗇𝗀
⭒ ִֶָ७☁️˙⋆｡ -𝗎𝗉𝗍𝗂𝗆𝖾


✮,— 𝐌𝐄𝐍𝐔𝐒 𝐃𝐈𝐒𝐏𝐎𝐍𝐈𝐁𝐋𝐄𝐒 .ᐟᨮׁׅ֮.ᐟ
  ৎ٠࣪⭑🔮𝄢 -𝗆𝖾𝗇𝗎
  ৎ٠࣪⭑🔮𝄢 -𝗆𝖾𝗇𝗎𝖿𝖿
  ৎ٠࣪⭑🔮𝄢 -𝗆𝖾𝗇𝗎𝗀𝗋𝗎𝗉𝗈𝗌


✮,— 𝐏𝐀𝐑𝐀 𝐆𝐑𝐔𝐏𝐎𝐒 .ᐟᨮׁׅ֮.ᐟ
  ৎ٠⭐️𝄢 -.𝗀𝗋𝗎𝗉𝗈 𝖺𝖻𝗋𝗂𝗋
  ৎ٠⭐️𝄢 -.𝗈𝗇 𝖺𝗇𝗍𝗂𝖺𝗋𝖺𝖻𝖾𝗌
  ৎ٠⭐️𝄢 -.𝗈𝗇 𝖺𝗇𝗍𝗂𝗅𝗂𝗇𝗄
  ৎ٠⭐️𝄢 -.𝗀𝗋𝗎𝗉𝗈 𝖼𝖾𝗋𝗋𝖺𝗋
  ৎ٠⭐️𝄢 -𝖽𝖾𝗅
  ৎ٠⭐️𝄢 -𝖽𝖾𝗆𝗈𝗍𝖾
  ৎ٠⭐️𝄢 -𝖿𝖺𝗇𝗍𝖺𝗌𝗆𝖺𝗌
  ৎ٠⭐️𝄢 -𝗸𝗶𝗰𝗸
  ৎ٠⭐️𝄢 -𝗸𝗶𝗰𝗸𝗳𝗮𝗻
  ৎ٠⭐️𝄢 -𝗹𝗶𝗻𝗸
  ৎ٠⭐️𝄢 -.𝗼𝗻 𝗺𝗼𝗱𝗼𝗮𝗱𝗺𝗶𝗻
  ৎ٠⭐️𝄢 -𝗺𝘂𝘁𝗲
  ৎ٠⭐️𝄢 -𝗡
  ৎ٠⭐️𝄢 -𝗽𝗿𝗼𝗺𝗼𝘁𝗲
  ৎ٠⭐️𝄢 -𝗿𝗲𝗴𝗹𝗮𝘀
  ৎ٠⭐️𝄢 -𝗿𝘂𝗹𝗲𝘁𝗮𝗯𝗮𝗻
  ৎ٠⭐️𝄢 -𝘀𝗲𝘁𝗳𝗼𝘁𝗼
  ৎ٠⭐️𝄢 -𝘀𝗲𝘁𝗶𝗻𝗳𝗼
  ৎ٠⭐️𝄢 -𝘀𝗲𝘁𝗻𝗮𝗺𝗲
  ৎ٠⭐️𝄢 -𝘀𝗲𝘁𝗿𝗲𝗴𝗹𝗮𝘀
  ৎ٠⭐️𝄢 -𝘀𝗲𝘁𝘄𝗲𝗹𝗰𝗼𝗺𝗲
  ৎ٠⭐️𝄢 -𝘁𝗼𝗱𝗼𝘀
  ৎ٠⭐️𝄢 -𝘂𝗻𝗯𝗮𝗻
  ৎ٠⭐️𝄢 -𝘂𝗻𝗺𝘂𝘁𝗲
  ৎ٠⭐️𝄢 -.𝗼𝗻 𝘄𝗲𝗹𝗰𝗼𝗺𝗲


✮,— 𝐏𝐀𝐑𝐀 𝐅𝐑𝐄𝐄 𝐅𝐈𝐑𝐄 👾.ᐟᨮׁׅ֮.ᐟ
  ৎ٠࣪🔥𝄢 -4𝘃𝘀4 𝗵𝗼𝗿𝗮 𝘆 𝗽𝗮𝗶𝘀
  ৎ٠࣪🔥𝄢 -6𝘃𝘀6 𝗵𝗼𝗿𝗮 𝘆 𝗽𝗮𝗶𝘀
  ৎ٠࣪🔥𝄢 -𝗰𝘂𝗮𝗱𝗿𝗶𝗹𝗮𝘁𝗲𝗿𝗼 𝗵𝗼𝗿𝗮 𝘆 𝗽𝗮𝗶𝘀
  ৎ٠࣪🔥𝄢 -𝗵𝗲𝘅𝗮𝗴𝗼𝗻𝗮𝗹 𝗵𝗼𝗿𝗮 𝘆 𝗽𝗮𝗶𝘀
  ৎ٠࣪🔥𝄢 -𝗶𝗻𝗍𝗲𝗿𝗻𝗮 𝗵𝗼𝗿𝗮 𝘆 𝗽𝗮𝗶𝘀
  ৎ٠࣪🔥𝄢 -𝘀𝗰𝗿𝗶𝗺 𝗵𝗼𝗿𝗮 𝘆 𝗽𝗮𝗶𝘀


✮,—𝐃𝐄𝐒𝐂𝐀𝐑𝐆𝐀𝐒📥 .ᐟᨮׁׅ֮.ᐟ
  ৎ٠࣪📦𝄢 𝗳𝗯
  ৎ٠࣪📦𝄢 -𝗶𝗴
  ৎ٠࣪📦𝄢 -𝗺𝗲𝗱𝗶𝗮𝗳𝗶𝗿𝗲
  ৎ٠࣪📦𝄢 -𝗽𝗹𝗮𝘆
  ৎ٠࣪📦𝄢 -𝗽𝗹𝗮𝘆2
  ৎ٠࣪📦𝄢 -𝗽𝗹𝗮𝘆𝗽𝗿𝗼
  ৎ٠࣪📦𝄢 -𝘀𝗽𝗼𝘁𝗶𝗳𝘆
  ৎ٠࣪📦𝄢 -𝘄𝗵𝗮𝘁𝗺𝘂𝘀𝗶𝗰
  ৎ٠࣪📦𝄢 -𝘆𝘁𝗺𝗽3
  ৎ٠࣪📦𝄢 -𝘆𝘁𝗺𝗽4


*𐚁 ֹ ִ *𝐇𝐄𝐑𝐑𝐀𝐌𝐈𝐄𝐍𝐓𝐀𝐒* ୧🛠 ֹ ִ*
  ৎ٠࣪⭑🔧𝄢 -ver
  ৎ٠࣪⭑🔧𝄢 -img
  ৎ٠࣪⭑🔧𝄢 -hd 

*𐚁 ֹ> 𝐌𝐢𝐧𝐢 𝐣𝐮𝐞𝐠𝐨𝐬* 🎮*
  ৎ٠࣪⭑🧩𝄢 -acertijo
  ৎ٠࣪⭑🧩𝄢 -cachuda
  ৎ٠࣪⭑🧩𝄢 -cachudo
  ৎ٠࣪⭑🧩𝄢 -casar
  ৎ٠࣪⭑🧩𝄢 -divorcio
  ৎ٠࣪⭑🧩𝄢 -enana
  ৎ٠࣪⭑🧩𝄢 -enano
  ৎ٠࣪⭑🧩𝄢 -fea
  ৎ٠࣪⭑🧩𝄢 -feo
  ৎ٠࣪⭑🧩𝄢 -gay
  ৎ٠࣪⭑🧩𝄢 -juegos
  ৎ٠࣪⭑🧩𝄢 -kiss
  ৎ٠࣪⭑🧩𝄢 -lesbiana
  ৎ٠࣪⭑🧩𝄢 -manca
  ৎ٠࣪⭑🧩𝄢 -manco
  ৎ٠࣪⭑🧩𝄢 -matrimonios
  ৎ٠࣪⭑🧩𝄢 -meme
  ৎ٠࣪⭑🧩𝄢 -negra
  ৎ٠࣪⭑🧩𝄢 -negro
  ৎ٠࣪⭑🧩𝄢 -pajera
  ৎ٠࣪⭑🧩𝄢 -pajero
  ৎ٠࣪⭑🧩𝄢 -pareja
  ৎ٠࣪⭑🧩𝄢 -personalidad
  ৎ٠࣪⭑🧩𝄢 -peruana
  ৎ٠࣪⭑🧩𝄢 -peruano
  ৎ٠࣪⭑🧩𝄢 -poema
  ৎ٠࣪⭑🧩𝄢 -ppt
  ৎ٠࣪⭑🧩𝄢 -puta
  ৎ٠࣪⭑🧩𝄢 -puto
  ৎ٠࣪⭑🧩𝄢 -rata
  ৎ٠࣪⭑🧩𝄢 -ship
  ৎ٠࣪⭑🧩𝄢 -pegar
  ৎ٠࣪⭑🧩𝄢 -verdad


*𐚁 ֹ ִ *𝐌𝐎𝐃𝐎 𝐈𝐀* ୧🤖 🚀*
  ৎ٠࣪⭑🔍𝄢 -dalle
  ৎ٠࣪⭑🔍𝄢 -gemini
  ৎ٠࣪⭑🔍𝄢 -imagen
  ৎ٠࣪⭑🔍𝄢 -luminai
  ৎ٠࣪⭑🔍𝄢 -pixai
  ৎ٠࣪⭑🔍𝄢 -tts
  ৎ٠࣪⭑🔍𝄢 -visión
  ৎ٠࣪⭑🔍𝄢 -vision2


*𐚁 ֹ ִ *𝐒𝐭𝐢𝐜𝐤𝐞𝐫𝐬* ୧🎭 ִ*
  ৎ٠࣪⭑🎨𝄢 -tourl
  ৎ٠࣪⭑🎨𝄢 -brat
  ৎ٠࣪⭑🎨𝄢 -mixemoji
  ৎ٠࣪⭑🎨𝄢 -qc
  ৎ٠࣪⭑🎨𝄢 -s


*𐚁 ֹ ִ *𝐏𝐀𝐑𝐀 𝐂𝐑𝐄𝐀𝐃𝐎𝐑* ୧👑 ֹ ִ*
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝘁𝗶𝗲𝗺𝗽𝗼 𝗮𝗰𝘁𝗶𝗰𝗼
  ৎ٠࣪⭑👨🏻‍💻𝄢 .𝗼𝗻 𝗮𝗻𝘁𝗶𝗽𝗿𝗶𝘃𝗮𝗱𝗼
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝗮𝘂𝘁𝗼𝗮𝗱𝗺𝗶𝗻
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝗮𝘃𝗶𝘀𝗼
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝘀𝗲𝘁𝗯𝗼𝘁𝗳𝗼𝘁𝗼
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝘀𝗲𝘁𝗯𝗼𝘁𝗻𝗮𝗺𝗲
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝗷𝗼𝗶𝗻
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝗹𝗶𝘀𝘁𝗮 𝗴𝗿𝘂𝗽𝗼𝘀
  ৎ٠࣪⭑👨🏻‍💻𝄢 -𝗿𝗲𝘀𝘁𝗮𝗿𝘁
> ©️ 𝐑𝐉 𝐁𝐎𝐓 𝐈𝐀𝖝 𝐇𝐄𝐑𝐍𝐀𝐍𝐃𝐄𝐙 - 🚀
`

  await conn.sendMessage(m.chat, {
    react: { text: "🧾", key: m.key }
  })

  await conn.sendMessage(
    m.chat,
    {
      video: { url: "https://files.catbox.moe/asebv1.mp4" },
      caption: menu,
      gifPlayback: true,
      mentions: [m.sender]
    },
    { quoted: m }
  )
}

handler.customPrefix = /^\.?(menu|menuall)$/i
handler.command = new RegExp()

export default handler